zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_FLEXCAN.h
/** Number of instances of the FLEXCAN module. */
#define FLEXCAN_INSTANCE_COUNT                   (18u)

/* FLEXCAN - Peripheral instance base addresses */
/** Peripheral FLEXCAN_0 base address */
#define IP_FLEXCAN_0_BASE                        (0x40290000u)
/** Peripheral FLEXCAN_0 base pointer */
#define IP_FLEXCAN_0                             ((FLEXCAN_Type *)IP_FLEXCAN_0_BASE)
/** Peripheral FLEXCAN_1 base address */
#define IP_FLEXCAN_1_BASE                        (0x40294000u)
/** Peripheral FLEXCAN_1 base pointer */
#define IP_FLEXCAN_1                             ((FLEXCAN_Type *)IP_FLEXCAN_1_BASE)
/** Peripheral FLEXCAN_2 base address */
#define IP_FLEXCAN_2_BASE                        (0x40298000u)
/** Peripheral FLEXCAN_2 base pointer */
#define IP_FLEXCAN_2                             ((FLEXCAN_Type *)IP_FLEXCAN_2_BASE)
/** Peripheral FLEXCAN_3 base address */
#define IP_FLEXCAN_3_BASE                        (0x4029C000u)
/** Peripheral FLEXCAN_3 base pointer */
#define IP_FLEXCAN_3                             ((FLEXCAN_Type *)IP_FLEXCAN_3_BASE)
/** Peripheral FLEXCAN_4 base address */
#define IP_FLEXCAN_4_BASE                        (0x402A0000u)
/** Peripheral FLEXCAN_4 base pointer */
#define IP_FLEXCAN_4                             ((FLEXCAN_Type *)IP_FLEXCAN_4_BASE)
/** Peripheral FLEXCAN_5 base address */
#define IP_FLEXCAN_5_BASE                        (0x402A4000u)
/** Peripheral FLEXCAN_5 base pointer */
#define IP_FLEXCAN_5                             ((FLEXCAN_Type *)IP_FLEXCAN_5_BASE)
/** Peripheral FLEXCAN_6 base address */
#define IP_FLEXCAN_6_BASE                        (0x402A8000u)
/** Peripheral FLEXCAN_6 base pointer */
#define IP_FLEXCAN_6                             ((FLEXCAN_Type *)IP_FLEXCAN_6_BASE)
/** Peripheral FLEXCAN_7 base address */
#define IP_FLEXCAN_7_BASE                        (0x402AC000u)
/** Peripheral FLEXCAN_7 base pointer */
#define IP_FLEXCAN_7                             ((FLEXCAN_Type *)IP_FLEXCAN_7_BASE)
/** Peripheral FLEXCAN_8 base address */
#define IP_FLEXCAN_8_BASE                        (0x406B0000u)
/** Peripheral FLEXCAN_8 base pointer */
#define IP_FLEXCAN_8                             ((FLEXCAN_Type *)IP_FLEXCAN_8_BASE)
/** Peripheral FLEXCAN_9 base address */
#define IP_FLEXCAN_9_BASE                        (0x406B4000u)
/** Peripheral FLEXCAN_9 base pointer */
#define IP_FLEXCAN_9                             ((FLEXCAN_Type *)IP_FLEXCAN_9_BASE)
/** Peripheral FLEXCAN_10 base address */
#define IP_FLEXCAN_10_BASE                       (0x406AC000u)
/** Peripheral FLEXCAN_10 base pointer */
#define IP_FLEXCAN_10                            ((FLEXCAN_Type *)IP_FLEXCAN_10_BASE)
/** Peripheral FLEXCAN_11 base address */
#define IP_FLEXCAN_11_BASE                       (0x4089C000u)
/** Peripheral FLEXCAN_11 base pointer */
#define IP_FLEXCAN_11                            ((FLEXCAN_Type *)IP_FLEXCAN_11_BASE)
/** Peripheral FLEXCAN_12 base address */
#define IP_FLEXCAN_12_BASE                       (0x408A0000u)
/** Peripheral FLEXCAN_12 base pointer */
#define IP_FLEXCAN_12                            ((FLEXCAN_Type *)IP_FLEXCAN_12_BASE)
/** Peripheral FLEXCAN_13 base address */
#define IP_FLEXCAN_13_BASE                       (0x408A4000u)
/** Peripheral FLEXCAN_13 base pointer */
#define IP_FLEXCAN_13                            ((FLEXCAN_Type *)IP_FLEXCAN_13_BASE)
/** Peripheral FLEXCAN_14 base address */
#define IP_FLEXCAN_14_BASE                       (0x408A8000u)
/** Peripheral FLEXCAN_14 base pointer */
#define IP_FLEXCAN_14                            ((FLEXCAN_Type *)IP_FLEXCAN_14_BASE)
/** Peripheral FLEXCAN_15 base address */
#define IP_FLEXCAN_15_BASE                       (0x408AC000u)
/** Peripheral FLEXCAN_15 base pointer */
#define IP_FLEXCAN_15                            ((FLEXCAN_Type *)IP_FLEXCAN_15_BASE)
/** Peripheral FLEXCAN_16 base address */
#define IP_FLEXCAN_16_BASE                       (0x408B0000u)
/** Peripheral FLEXCAN_16 base pointer */
#define IP_FLEXCAN_16                            ((FLEXCAN_Type *)IP_FLEXCAN_16_BASE)
/** Peripheral LPE_FLEXCAN base address */
#define IP_LPE_FLEXCAN_BASE                      (0x42174000u)
/** Peripheral LPE_FLEXCAN base pointer */
#define IP_LPE_FLEXCAN                           ((FLEXCAN_Type *)IP_LPE_FLEXCAN_BASE)
/** Array initializer of FLEXCAN peripheral base addresses */
#define IP_FLEXCAN_BASE_ADDRS                    { IP_FLEXCAN_0_BASE, IP_FLEXCAN_1_BASE, IP_FLEXCAN_2_BASE, IP_FLEXCAN_3_BASE, IP_FLEXCAN_4_BASE, IP_FLEXCAN_5_BASE, IP_FLEXCAN_6_BASE, IP_FLEXCAN_7_BASE, IP_FLEXCAN_8_BASE, IP_FLEXCAN_9_BASE, IP_FLEXCAN_10_BASE, IP_FLEXCAN_11_BASE, IP_FLEXCAN_12_BASE, IP_FLEXCAN_13_BASE, IP_FLEXCAN_14_BASE, IP_FLEXCAN_15_BASE, IP_FLEXCAN_16_BASE, IP_LPE_FLEXCAN_BASE }
/** Array initializer of FLEXCAN peripheral base pointers */
#define IP_FLEXCAN_BASE_PTRS                     { IP_FLEXCAN_0, IP_FLEXCAN_1, IP_FLEXCAN_2, IP_FLEXCAN_3, IP_FLEXCAN_4, IP_FLEXCAN_5, IP_FLEXCAN_6, IP_FLEXCAN_7, IP_FLEXCAN_8, IP_FLEXCAN_9, IP_FLEXCAN_10, IP_FLEXCAN_11, IP_FLEXCAN_12, IP_FLEXCAN_13, IP_FLEXCAN_14, IP_FLEXCAN_15, IP_FLEXCAN_16, IP_LPE_FLEXCAN }

/* ----------------------------------------------------------------------------
   -- FLEXCAN Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXCAN_Register_Masks FLEXCAN Register Masks
 * @{
 */

/*! @name MCR - Module Configuration */
/*! @{ */

#define FLEXCAN_MCR_MAXMB_MASK                   (0x7FU)
#define FLEXCAN_MCR_MAXMB_SHIFT                  (0U)
#define FLEXCAN_MCR_MAXMB_WIDTH                  (7U)
#define FLEXCAN_MCR_MAXMB(x)                     (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_MAXMB_SHIFT)) & FLEXCAN_MCR_MAXMB_MASK)

#define FLEXCAN_MCR_TPOE_MASK                    (0x80U)
#define FLEXCAN_MCR_TPOE_SHIFT                   (7U)
#define FLEXCAN_MCR_TPOE_WIDTH                   (1U)
#define FLEXCAN_MCR_TPOE(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_TPOE_SHIFT)) & FLEXCAN_MCR_TPOE_MASK)

#define FLEXCAN_MCR_IDAM_MASK                    (0x300U)
#define FLEXCAN_MCR_IDAM_SHIFT                   (8U)
#define FLEXCAN_MCR_IDAM_WIDTH                   (2U)
#define FLEXCAN_MCR_IDAM(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_IDAM_SHIFT)) & FLEXCAN_MCR_IDAM_MASK)

#define FLEXCAN_MCR_TPOV_MASK                    (0x400U)
#define FLEXCAN_MCR_TPOV_SHIFT                   (10U)
#define FLEXCAN_MCR_TPOV_WIDTH                   (1U)
#define FLEXCAN_MCR_TPOV(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_TPOV_SHIFT)) & FLEXCAN_MCR_TPOV_MASK)

#define FLEXCAN_MCR_FDEN_MASK                    (0x800U)
#define FLEXCAN_MCR_FDEN_SHIFT                   (11U)
#define FLEXCAN_MCR_FDEN_WIDTH                   (1U)
#define FLEXCAN_MCR_FDEN(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_FDEN_SHIFT)) & FLEXCAN_MCR_FDEN_MASK)

#define FLEXCAN_MCR_AEN_MASK                     (0x1000U)
#define FLEXCAN_MCR_AEN_SHIFT                    (12U)
#define FLEXCAN_MCR_AEN_WIDTH                    (1U)
#define FLEXCAN_MCR_AEN(x)                       (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_AEN_SHIFT)) & FLEXCAN_MCR_AEN_MASK)

#define FLEXCAN_MCR_LPRIOEN_MASK                 (0x2000U)
#define FLEXCAN_MCR_LPRIOEN_SHIFT                (13U)
#define FLEXCAN_MCR_LPRIOEN_WIDTH                (1U)
#define FLEXCAN_MCR_LPRIOEN(x)                   (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_LPRIOEN_SHIFT)) & FLEXCAN_MCR_LPRIOEN_MASK)

#define FLEXCAN_MCR_DMA_MASK                     (0x8000U)
#define FLEXCAN_MCR_DMA_SHIFT                    (15U)
#define FLEXCAN_MCR_DMA_WIDTH                    (1U)
#define FLEXCAN_MCR_DMA(x)                       (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_DMA_SHIFT)) & FLEXCAN_MCR_DMA_MASK)

#define FLEXCAN_MCR_IRMQ_MASK                    (0x10000U)
#define FLEXCAN_MCR_IRMQ_SHIFT                   (16U)
#define FLEXCAN_MCR_IRMQ_WIDTH                   (1U)
#define FLEXCAN_MCR_IRMQ(x)                      (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_IRMQ_SHIFT)) & FLEXCAN_MCR_IRMQ_MASK)

#define FLEXCAN_MCR_SRXDIS_MASK                  (0x20000U)
#define FLEXCAN_MCR_SRXDIS_SHIFT                 (17U)
#define FLEXCAN_MCR_SRXDIS_WIDTH                 (1U)
#define FLEXCAN_MCR_SRXDIS(x)                    (((uint32_t)(((uint32_t)(x)) << FLEXCAN_MCR_SRXDIS_SHIFT)) & FLEXCAN_MCR_SRXDIS_MASK)

